jFoster426/jFoster426.github.io/Projects/DIYPACEISB/PACE ISB Cubby/Microchip.PIC16Fxxx_DFP.1.7.162/edc/PIC16HV753.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="HLTMR2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="HLTMR2" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x117">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="HLTMR2" edc:desc="" edc:mask="0xff" edc:name="HLTMR2" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="HLTPR2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="HLTPR2" edc:nzwidth="8" edc:por="11111111" edc:_addr="0x118">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="HLTPR2" edc:desc="" edc:mask="0xff" edc:name="HLTPR2" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="HLT2CON0" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="HLT2CON0" edc:nzwidth="8" edc:por="-0000000" edc:_addr="0x119">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="H2CKPS" edc:desc="" edc:mask="0x3" edc:name="H2CKPS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="H2ON" edc:desc="" edc:mask="0x1" edc:name="H2ON" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="H2OUTPS" edc:desc="" edc:mask="0xf" edc:name="H2OUTPS" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="H2CKPS0" edc:desc="" edc:mask="0x1" edc:name="H2CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="H2CKPS1" edc:desc="" edc:mask="0x1" edc:name="H2CKPS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="H2OUTPS0" edc:desc="" edc:mask="0x1" edc:name="H2OUTPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="H2OUTPS1" edc:desc="" edc:mask="0x1" edc:name="H2OUTPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="H2OUTPS2" edc:desc="" edc:mask="0x1" edc:name="H2OUTPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="H2OUTPS3" edc:desc="" edc:mask="0x1" edc:name="H2OUTPS3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn-nnnnn" edc:cname="HLT2CON1" edc:desc="" edc:impl="0xdf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11-00000" edc:name="HLT2CON1" edc:nzwidth="8" edc:por="11-00000" edc:_addr="0x11A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="H2REREN" edc:desc="" edc:mask="0x1" edc:name="H2REREN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="H2FEREN" edc:desc="" edc:mask="0x1" edc:name="H2FEREN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="H2ERS" edc:desc="" edc:mask="0x7" edc:name="H2ERS" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="H2RES" edc:desc="" edc:mask="0x1" edc:name="H2RES" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="H2FES" edc:desc="" edc:mask="0x1" edc:name="H2FES" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="H2ERS0" edc:desc="" edc:mask="0x1" edc:name="H2ERS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="H2ERS1" edc:desc="" edc:mask="0x1" edc:name="H2ERS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="H2ERS2" edc:desc="" edc:mask="0x1" edc:name="H2ERS2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="3" edc:_addr="0x11B"/>
        <edc:SFRDef edc:access="n-nnnn-n" edc:cname="SLPC1CON0" edc:desc="" edc:impl="0xbd" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-0000-0" edc:name="SLPC1CON0" edc:nzwidth="8" edc:por="0-0000-0" edc:_addr="0x11E">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="SLPCCON0"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SC1INS" edc:desc="" edc:mask="0x1" edc:name="SC1INS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SC1TSS" edc:desc="" edc:mask="0x3" edc:name="SC1TSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="SC1POL" edc:desc="" edc:mask="0x1" edc:name="SC1POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SC1MRPE" edc:desc="" edc:mask="0x1" edc:name="SC1MRPE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SC1EN" edc:desc="" edc:mask="0x1" edc:name="SC1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="SCS1TSS0" edc:desc="" edc:mask="0x1" edc:name="SCS1TSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCS1TSS1" edc:desc="" edc:mask="0x1" edc:name="SCS1TSS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="SLPC1CON1" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="SLPC1CON1" edc:nzwidth="8" edc:por="---00000" edc:_addr="0x11F">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="SLPCCON1"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SC1ISET" edc:desc="" edc:mask="0xf" edc:name="SC1ISET" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="SC1RNG" edc:desc="" edc:mask="0x1" edc:name="SC1RNG" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SC1ISET0" edc:desc="" edc:mask="0x1" edc:name="SC1ISET0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SC1ISET1" edc:desc="" edc:mask="0x1" edc:name="SC1ISET1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SC1ISET2" edc:desc="" edc:mask="0x1" edc:name="SC1ISET2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SC1ISET3" edc:desc="" edc:mask="0x1" edc:name="SC1ISET3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="3" edc:beginaddr="0x180" edc:endaddr="0x1A0" edc:regionid="sfr3">
        <edc:Mirror edc:nzsize="1" edc:regionidref="sfr0" edc:_addr="0x180"/>
        <edc:Mirror edc:nzsize="1" edc:regionidref="sfr1" edc:_addr="0x181"/>
        <edc:Mirror edc:nzsize="3" edc:regionidref="sfr0" edc:_addr="0x182"/>
        <edc:SFRDef edc:access="---n-nnn" edc:cname="ANSELA" edc:desc="" edc:impl="0x17" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---1-111" edc:name="ANSELA" edc:nzwidth="8" edc:por="---1-111" edc:_addr="0x185">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSA0" edc:desc="" edc:mask="0x1" edc:name="ANSA0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSA1" edc:desc="" edc:mask="0x1" edc:name="ANSA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSA2" edc:desc="" edc:mask="0x1" edc:name="ANSA2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ANSA4" edc:desc="" edc:mask="0x1" edc:name="ANSA4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x186"/>
        <edc:SFRDef edc:access="----nnnn" edc:cname="ANSELC" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----1111" edc:name="ANSELC" edc:nzwidth="8" edc:por="----1111" edc:_addr="0x187">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSC0" edc:desc="" edc:mask="0x1" edc:name="ANSC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSC1" edc:desc="" edc:mask="0x1" edc:name="ANSC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSC2" edc:desc="" edc:mask="0x1" edc:name="ANSC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSC3" edc:desc="" edc:mask="0x1" edc:name="ANSC3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
